shapes.org
# -*- mode: Org; org-use-property-inheritance: t -*-

#+STARTUP: overview
#+FILETAGS: :emacs:



#+title:Shapes
#+PROPERTY: header-args:emacs-lisp :results none :mkdirp yes



* Core
** Load
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./core/shapes-load.el
:END:

#+begin_src emacs-lisp

(defcustom shapes-debug-on-error t
  "Whether to enter the debugger if a shapes module, layer or
extension fails to load.")

(defun shapes-load (type component)
  "Load a shapes COMPONENT of the given TYPE"
  (condition-case err
      (require (intern (concat "shapes-" type "-" component)) (concat config-directory type "s" "/shapes-" component ".el"))
    (error (progn (message "ERROR: shapes-%s %s load failed" component type)
		     (if shapes-debug-on-error
		         (debug err))))))

;; shapes modules
(defun shapes-module (module)
  "Load a shapes MODULE by name"
  (shapes-load "module" module))

;; shapes layers
(defun shapes-layer (layer)
  "Load a shapes LAYER by name"
  (shapes-load "layer" layer))

;; shapes extensions
(defun shapes-extend (extension)
  "Load a shapes EXTENSION by name"
  (shapes-load "extension" extension))

#+end_src

** Extensions
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./core/shapes-extensions.el
:END:

#+begin_src emacs-lisp

(shapes-extend "get")
(shapes-extend "queries")
(shapes-extend "execution")
(shapes-extend "operators")

#+end_src

** Package manager
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./core/shapes-package-manager.el
:END:

#+begin_src emacs-lisp

(shapes-module "straight")
(shapes-module "use-package")

#+end_src

** Config management
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./core/shapes-config-management.el
:END:
*** Tangling

#+begin_src emacs-lisp

(shapes-module "async")

(defun custom/shapes-tangle (org-file &optional quiet)
  "Asynchronously tangle an org file."
  (let ((init-tangle-start-time (current-time))
	(file (buffer-file-name))
	(async-quiet-switch "-q"))
    (async-start
     `(lambda ()
              (dolist (comp-dir (mapcar (lambda (dir) (concat ,config-directory dir)) '("core" "layers" "modules" "extensions")))
                (dolist (file (directory-files comp-dir t directory-files-no-dot-files-regexp))
                  (delete-file file)))
	      (require 'org)
	      (add-hook 'org-babel-post-tangle-hook
			(lambda ()
				(string-match "\\(^.*/\\)\\(.*\\)\\(/shapes-\\)\\(.*\\)\\(.el\\)" (buffer-file-name))
				(let ((component (match-string 4 (buffer-file-name)))
				      (comp-type (match-string 2 (buffer-file-name))))
				     (end-of-buffer)
				     (insert (concat
					      "\n"
					      "(provide 'shapes-" (if (string-match-p "^.*s" comp-type)
                                                                      (substring comp-type 0 -1)
                                                                    comp-type)
                                              "-" component ")\n"
					      ";;; shapes-" component ".el ends here"))
				     (save-buffer))))
		   (org-babel-tangle-file ,org-file))
     (unless quiet
       `(lambda (result)
		     (if result
			 (message "SUCCESS: %s successfully tangled (%.2fs)."
				  ,(file-name-nondirectory org-file)
				  (float-time (time-subtract (current-time)
							     ',init-tangle-start-time)))
		       (message "ERROR: %s tangling failed." ,org-file)))))))

(defun custom/shapes-tangle-auto ()
  "Automatically tangle Org Mode files in the Emacs config directory"
  (let* ((file   (expand-file-name buffer-file-name))
	 (source (string-match (concat config-directory ".*.org$") file))
	 (shapes (string-match (concat config-directory "shapes.org$") buffer-file-name))
	 (org-confirm-babel-evaluate nil))
    (if source
	(if shapes
	    (custom/shapes-tangle file)
	  (org-babel-tangle)))))

(add-hook 'after-save-hook #'custom/shapes-tangle-auto)

#+end_src

*** Littering

#+begin_src emacs-lisp

(shapes-module "no-littering")

#+end_src

*** Patching

#+begin_src emacs-lisp

(shapes-module "el-patch")

#+end_src

*** Execution

#+begin_src emacs-lisp

(global-set-key (kbd "C-x e") #'eval-buffer)

#+end_src

*** Inspection

#+begin_src emacs-lisp

(global-set-key (kbd "C-c SPC") #'whitespace-mode)

#+end_src

*** Debugging

#+begin_src emacs-lisp

(setq debug-on-error nil)

#+end_src


* Layers

Content of a layer:
- Settings
- Built-in modes
- Modules
- Extensions
- Bindings

** UI
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./layers/shapes-ui.el
:END:
*** Text
**** Typefaces

#+begin_src emacs-lisp

;; icons
(shapes-module "all-the-icons")

#+end_src

**** Highlights

#+begin_src emacs-lisp

;; highlights
(shapes-module "rainbow-mode")

#+end_src

*** Buffer

#+begin_src emacs-lisp

;; centering
(shapes-module "olivetti")

;; line numbers
(global-set-key (kbd "C-c l") #'display-line-numbers-mode)

#+end_src

*** Frame

#+begin_src emacs-lisp

;; size
(add-to-list 'default-frame-alist '(height . 50))
(add-to-list 'default-frame-alist '(width  . 70))

;; tabs
(tab-bar-mode -1)
;; scroll bar
(scroll-bar-mode -1)
;; toolbar
(tool-bar-mode -1)
;; tooltips
(tooltip-mode -1)
;; menu bar
(menu-bar-mode -1)

;; title
(setq-default frame-title-format '("%b"))

#+end_src

*** Window

#+begin_src emacs-lisp

;; fringes
(set-fringe-mode nil)

;; balance
(global-set-key (kbd "C-x -") #'balance-windows)

;; split threshold
(setq split-width-threshold 70)

#+end_src

*** Warnings

#+begin_src emacs-lisp

;; visible bell
(setq visible-bell t)

#+end_src

*** Mode line

#+begin_src emacs-lisp

;; time
(display-time-mode t)

;; column numbers
(column-number-mode)

;; mode display
(shapes-module "delight")

#+end_src

*** Dashboard

#+begin_src emacs-lisp

;; requirements
(shapes-module "projectile")
(shapes-module "all-the-icons")
(shapes-module "page-break-lines")

;; dashboard
(shapes-module "emacs-dashboard")

#+end_src

*** Extensions

#+begin_src emacs-lisp

;; extensions
(shapes-extend "ui")

#+end_src

** Themes
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./layers/shapes-themes.el
:END:

Shapes themes layer. It requires three variables to be defined: the light and dark themes (~light~ and ~dark~ respectively), and the mode line of choice (~modeline~).

#+begin_src emacs-lisp

(defcustom light 'modus-operandi
  "Light theme")
(defcustom dark  'modus-vivendi
  "Dark theme")

;; creation
(shapes-module "autothemer")

;; theme bundles
(shapes-module "ef-themes")
(shapes-module "nano-theme")
(shapes-module "doom-themes")
(shapes-module "modus-themes")
(shapes-module "solarized-theme")
(shapes-module "catppuccin-themes")
;; standalone themes
(shapes-module "sweet-theme")
(shapes-module "graphite-theme")
(shapes-module "chocolate-theme")

;; extensions
(shapes-extend "theme-switch")

;; scheduling
(shapes-module "circadian")

#+end_src

** Mode line
*** Doom
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./layers/shapes-modeline-doom.el
:END:

#+begin_src emacs-lisp

;; modules
(shapes-module "doom-modeline")

;; extensions
(shapes-extend "theme-modeline")

#+end_src

*** Nano
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./layers/shapes-modeline-nano.el
:END:

#+begin_src emacs-lisp

;; modules
(shapes-module "nano-modeline")

;; extensions
(shapes-extend "theme-modeline")

#+end_src

*** Moody
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./layers/shapes-modeline-moody.el
:END:

#+begin_src emacs-lisp

(shapes-module "moody")

;; modeline height
(setq moody-mode-line-height 22)

;; adjust modeline elements to enable moody
(let ((line (face-attribute 'mode-line :underline)))
  (set-face-attribute 'mode-line          nil :overline   line)
  (set-face-attribute 'mode-line-inactive nil :overline   line)
  (set-face-attribute 'mode-line-inactive nil :underline  line)
  (set-face-attribute 'mode-line          nil :box        nil)
  (set-face-attribute 'mode-line-inactive nil :box        nil))

;; extensions
(shapes-extend "theme-modeline")

#+end_src

*** Spaceline
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./layers/shapes-modeline-spaceline.el
:END:

#+begin_src emacs-lisp

;; modules
(shapes-module "spaceline")

#+end_src


** Input
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./layers/shapes-input.el
:END:

#+begin_src emacs-lisp

;; bindings
(global-set-key (kbd "C-=") #'save-buffer)

;; confirmation
(advice-add 'yes-or-no-p :override #'y-or-n-p)
;; advanced commands
(put 'narrow-to-region 'disabled nil)

;; modules
(shapes-module "evil")
(shapes-module "god-mode")

#+end_src

** Completion
*** ivy
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./layers/shapes-completion-ivy.el
:END:

#+begin_src emacs-lisp

(shapes-module "ivy")

#+end_src

*** vertico
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./layers/shapes-completion-vertico.el
:END:

#+begin_src emacs-lisp

(shapes-module "vertico")
(shapes-module "orderless")

;; icons
(shapes-module "all-the-icons")
(shapes-module "all-the-icons-completion")

#+end_src
** Navigation
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./layers/shapes-navigation.el
:END:

#+begin_src emacs-lisp

;; scrolling
(pixel-scroll-precision-mode)
(setq auto-window-vscroll nil)
(setq mouse-wheel-progressive-speed nil)

;; windows
(winner-mode)

;; modules
(shapes-module "ace-window")

;; extensions
(shapes-extend "navigation")

;; bindings
(global-set-key (kbd "C-S-n") #'make-frame-command)

#+end_src


** Search
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./layers/shapes-search.el
:END:

#+begin_src emacs-lisp

;; modules
(shapes-module "swiper")
(shapes-module "rg")

;; extensions
(shapes-extend "search")

#+end_src

** Editing
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./layers/shapes-editing.el
:END:

#+begin_src emacs-lisp

;; settings
(setq-default indent-tabs-mode nil)

;; built-ins
(global-so-long-mode 1)

;; modules
(shapes-module "vundo")
(shapes-module "multiple-cursors")

;; extensions
(shapes-extend "editing")

#+end_src

** Workflow
*** Session
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./layers/shapes-session.el
:END:

#+begin_src emacs-lisp

;; built-ins
(desktop-save-mode 1)

;; modules
(shapes-module "workgroups")

;; extensions
(shapes-extend "session")
(shapes-extend "external-programs")

#+end_src 

*** Project interaction
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./layers/shapes-project-interaction.el
:END:

#+begin_src emacs-lisp

;; modules
(shapes-module "projectile")
(shapes-module "treemacs")

#+end_src
a

** Version control
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./layers/shapes-version-control.el
:END:

#+begin_src emacs-lisp

(shapes-module "magit")
(shapes-module "forge")

#+end_src

** File management
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./layers/shapes-file-management.el
:END:

~backup-directory-alist~, which determines where backups are saved, is set by ~no-littering~.

#+begin_src emacs-lisp

;; buffer backups
(setq backup-by-copying t)
(setq version-control t)
(setq delete-old-versions t)
(setq kept-new-versions 2)
(setq kept-old-versions 2)

;; file manager
(shapes-module "dirvish")

;; extensions
(shapes-extend "file-management")

#+end_src


** IDE
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./layers/shapes-ide.el
:END:

#+begin_src emacs-lisp

;; remove duplicates in shell history
(setq comint-input-ignoredups t)
;; indentation
(setq-default c-basic-offset 4)

;; outline
(shapes-module "hideshow")
;; editing
(shapes-module "puni")
(shapes-module "embrace")
;; completion
(shapes-module "company")
;; syntax checking
(shapes-module "flycheck")
;; language server protocol
(shapes-module "lsp-mode")

;; lisp
(shapes-module "rainbow-delimiters")
;; python
(shapes-module "elpy")
;; rust
(shapes-module "rustic")

#+end_src

** PDF
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./layers/shapes-pdf.el
:END:

#+begin_src emacs-lisp

;; settings
(setq doc-view-resolution 250)

;; requirements
(shapes-module "tablist")

;; modules
(shapes-module "pdf-tools")
(shapes-module "pdf-view-restore")

;; extensions
(shapes-extend "pdf")

#+end_src

** LaTeX
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./layers/shapes-latex.el
:END:

#+begin_src emacs-lisp

(add-hook 'latex-mode-hook (lambda () (visual-line-mode nil)))

#+end_src

** Org Mode
*** org
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./layers/shapes-org.el
:END:

#+begin_src emacs-lisp

;; bindings
(global-set-key (kbd "C-x c") #'org-capture)

;; always use property inheritance
(setq-default org-use-property-inheritance t)

;; dependencies
(shapes-layer  "editing")

;; org
(shapes-module "org")

;; editing
(shapes-module "org-paragraph")
(shapes-module "org-download")

;; templates
(shapes-module "org-tempo")
(shapes-module "org-capture")

;; agenda - IMPORTANT: LOAD BEFORE org-roam
(shapes-module "org-agenda")
(shapes-module "org-contacts")
(shapes-module "org-calendar")

;; notes
(shapes-module "bitacora")
(shapes-module "org-roam")

;; presentations
(shapes-module "org-reveal")

;; programming
(shapes-module "org-babel")

;; extensions
(shapes-extend "org-get")
(shapes-extend "org-queries")
(shapes-extend "org-editing")
(shapes-extend "org-ui")
(shapes-extend "org-outline")
(shapes-extend "org-navigation")
(shapes-extend "org-applications")

#+end_src

