modules/shapes-emacs-dashboard.el
(shapes-module "projectile")
(shapes-module "all-the-icons")
(shapes-module "page-break-lines")
