modules/shapes-pdf-tools.el
(shapes-module "tablist")
