shapes.org
*** org-ui
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./layers/shapes-org-ui.el
:END:

#+begin_src emacs-lisp

;; org-indent-mode
(setq org-startup-indented nil)
;; list indentation
(setq-default org-list-indent-offset 1)
;; startup with inline images
(setq org-startup-with-inline-images t)
;; do not force inline images to their actual width
(setq org-image-actual-width nil)
;; do not consider empty lines content
(setq org-cycle-separator-lines 2)

;; line wrapping
(add-hook 'org-mode-hook (lambda () (progn (visual-line-mode 1) (setq line-move-visual t))))

;; design
(shapes-module "org-modern")
(setq org-modern-table        nil)
(setq org-modern-block-fringe nil)

;; markup
(shapes-module "org-appear")

#+end_src

*** org-agenda
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./layers/shapes-org-agenda.el
:END:
**** Files

#+begin_src emacs-lisp

(let ((files org-agenda-files))
  (dolist (file files)
    (if (not (file-exists-p file))
        (progn (setq org-agenda-files (remove file files))
               (print (concat "WARNING: ignoring nonexistent agenda file: " file))))))

#+end_src

**** Tags

#+begin_src emacs-lisp

(setq org-tag-alist
      '((:startgroup)
	;; Put mutually exclusive tags here
	(:endgroup)
	("home"     . ?h)
	("work"     . ?w)))

#+end_src

**** Views

#+begin_src emacs-lisp

;; Configure custom agenda views
(setq org-agenda-custom-commands
      '(("d" "Dashboard"
	 ((agenda "" ((org-deadline-warning-days 7)))
	  (todo "NEXT" ((org-agenda-overriding-header "Next Tasks")))
	  (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

	("n" "Next Tasks"
	 ((todo "NEXT" ((org-agenda-overriding-header "Next Tasks")))))

	("w" "Work Tasks" tags-todo "work")

	("e" "Emacs Tasks" tags-todo "emacs")

	("z" "Low Effort" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
	 ((org-agenda-overriding-header "Low Effort Tasks")
	  (org-agenda-max-todos 20)
	  (org-agenda-files org-agenda-files)))

	("s" "Workflow Status"
	 ((todo "WAIT"
		((org-agenda-overriding-header "Waiting on External")
		 (org-agenda-files org-agenda-files)))
	  (todo "REVIEW"
		((org-agenda-overriding-header "In Review")
		 (org-agenda-files org-agenda-files)))
	  (todo "PLAN"
		((org-agenda-overriding-header "In Planning")
		 (org-agenda-todo-list-sublevels nil)
		 (org-agenda-files org-agenda-files)))
	  (todo "BACKLOG"
		((org-agenda-overriding-header "Project Backlog")
		 (org-agenda-todo-list-sublevels nil)
		 (org-agenda-files org-agenda-files)))
	  (todo "READY"
		((org-agenda-overriding-header "Ready for Work")
		 (org-agenda-files org-agenda-files)))
	  (todo "ACTIVE"
		((org-agenda-overriding-header "Active Projects")
		 (org-agenda-files org-agenda-files)))
	  (todo "COMPLETED"
		((org-agenda-overriding-header "Completed Projects")
		 (org-agenda-files org-agenda-files)))
	  (todo "CANC"
		((org-agenda-overriding-header "Cancelled Projects")
		 (org-agenda-files org-agenda-files)))))))

#+end_src

**** Keywords

#+begin_src emacs-lisp

;; Define TODO keyword sequences
(setq org-todo-keywords
      '((sequence "TODO(t)" "NEXT(n)" "WAIT(w@/!)" "|" "DONE(d!)")
	(sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(r)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")))

#+end_src

*** org-typesetting
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./layers/shapes-org-typesetting.el
:END:
**** Text
***** Typefaces
****** Body

#+begin_src emacs-lisp

(defun custom/org-typefaces-body ()
  (with-eval-after-load 'org-faces

    ;; Code
    (set-face-attribute 'org-block                 nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-code                  nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim              nil :inherit '(shadow fixed-pitch))

    ;; Tables
    (set-face-attribute 'org-table                 nil :inherit '(shadow fixed-pitch))

    ;; Lists
    (set-face-attribute 'org-checkbox              nil :inherit 'fixed-pitch)

    ;; Meta
    (set-face-attribute 'org-meta-line             nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-document-info         nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-document-info-keyword nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-special-keyword       nil :inherit 'fixed-pitch)))

(add-hook 'org-mode-hook #'custom/org-typefaces-body)

#+end_src

****** Heading

#+begin_src emacs-lisp

;; use levels 1 through 8
(setq org-n-level-faces 8)

;; do not cycle header style after 8th level
(setq org-cycle-level-faces nil)

;; hide leading stars
(setq org-hide-leading-starts t)

;; font sizes
(defun custom/org-heading-typefaces () 
  (with-eval-after-load 'org-faces
    (dolist (face '((org-level-1 . 1.175)
                    (org-level-2 . 1.175)
                    (org-level-3 . 1.175)
                    (org-level-4 . 1.175)
                    (org-level-5 . 1.175)
                    (org-level-6 . 1.175)
                    (org-level-7 . 1.175)
                    (org-level-8 . 1.175)))
         (set-face-attribute (car face) nil :font typeface-heading :weight 'bold :height (cdr face)))))

(add-hook 'org-mode-hook #'custom/org-heading-typefaces)

#+end_src

***** Pretty entities

#+begin_src emacs-lisp

;; symbols, super- and subscripts
(setq org-pretty-entities nil)

#+end_src

**** Icons
***** Ellipses

Candidates:
- triangles
  ▼
  ▾
  ▿
- rhomboids
  ⬙
  ⟡
  ⬥
  ♦
  ♢
- non-compliant
  ⧨
  
-----

#+begin_src emacs-lisp

;; Change ellipsis ("...") to remove clutter
(setq org-ellipsis " ♢")

#+end_src

*** org-latex-preview
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./layers/shapes-org-latex-preview.el
:END:

#+begin_src emacs-lisp

(shapes-module "org-fragtog")

#+end_src

**** TODO Options

- mail bug in

Importantly, ~modus-vivendi~ will not behave correctly with
the default ~org-format-latex-options~, with LaTeX previews
displaying as white boxes. [[https://debbugs.gnu.org/db/52/52277.html][This has been previously reported]].

~org-format-latex-options~ has ~:foreground~ and ~:background~
attributes. These may be assigned to

- a color,
- ~default~, instructing Org Mode to determine ~:foreground~ or
  ~:background~ from the foreground or background color of the
  default face, or
- ~auto~, doing the same for the text face.

By default, the ~:foreground~ and ~:background~ in ~org-format-latex-options~
are set to ~default~. With default settings, changing the color
of the ~default~ font has the following effects on the LaTeX preview SVGs:

- modus-operandi
   - ~default :foreground~: text color
   - ~default :background~: no effect
- modus-vivendi
   - ~default :foreground~: background color
   - ~default :background~: no effect

By eliminating the ~:background~ attribute from ~org-format-latex-options~
the issue is resolved.

1. ~modus-operandi~ does not suffer from this issue nor do various
   other themes. This makes me believe the issue lies with
   ~modus-vivendi~ itself.
2. However, the ~:background~ attribute in ~org-format-latex-options~
   seems to have no effect, a potential bug in Org Mode

#+begin_src emacs-lisp

(setq org-format-latex-options
        (list :foreground 'default
              :scale       1.000))

#+end_src

**** Header

#+begin_src emacs-lisp

(setq custom/org-latex-preview-class-args "fleqn")
(setq custom/org-latex-preview-width      "18cm")

(setq org-format-latex-header
      (string-join `("\\documentclass[" ,custom/org-latex-preview-class-args "]{article}"
		         "\\usepackage[usenames]{color}"
			
			 "\\usepackage{bm}"
			
			 "\\pagestyle{empty}"
			 "\\setlength{\\textwidth}{" ,custom/org-latex-preview-width "}"
			 "\\addtolength{\\textwidth}{-3cm}"
			 "\\setlength{\\oddsidemargin}{1.5cm}"
			 "\\addtolength{\\oddsidemargin}{-2.54cm}"
			 "\\setlength{\\evensidemargin}{\\oddsidemargin}"
			 "\\setlength{\\textheight}{\\paperheight}"
			 "\\addtolength{\\textheight}{-\\headheight}"
			 "\\addtolength{\\textheight}{-\\headsep}"
			 "\\addtolength{\\textheight}{-\\footskip}"
			 "\\addtolength{\\textheight}{-3cm}"
			 "\\setlength{\\topmargin}{1.5cm}"
			 "\\addtolength{\\topmargin}{-2.54cm}")
		   "\n"))

#+end_src

**** Equation preview format

#+begin_src emacs-lisp

;; SVG LaTeX equation preview
(setq org-latex-create-formula-image-program 'dvisvgm)

#+end_src

**** Equation preview directory

#+begin_src emacs-lisp

;; theme-specific LaTeX preview directory
(defun custom/latex-preview-directory ()
  "Set `org-preview-latex-image-directory' to the SVG
LaTeX preview directory of the current theme"
  (setq org-preview-latex-image-directory
   (concat "/tmp/ltximg/" (custom/get-active-theme) "/")))

#+end_src

**** Equation preview reload hook

#+begin_src emacs-lisp

(defun custom/latex-preview-reload ()
  "Reload all LaTeX previews in buffer,
ensuring the LaTeX preview directory
matches the current theme."
  (if (string-equal major-mode "org-mode")
      (progn (org-latex-preview '(64))
	        (custom/latex-preview-directory)
		(org-latex-preview '(16)))))

(add-hook 'org-mode-hook #'custom/latex-preview-reload)

#+end_src


* Modules

Content of a module:
- Package installation
- Package setup

** Infrastructure
*** Package management
**** straight
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-straight.el
:END:

#+begin_src emacs-lisp

;; straight.el
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

#+end_src

**** use-package
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-use-package.el
:END:

#+begin_src emacs-lisp

;; use-package
(straight-use-package 'use-package)

;; fall back to straight.el
(setq straight-use-package-by-default t)

#+end_src

*** Config management
**** Async
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-async.el
:END:

#+begin_src emacs-lisp

;; async
(straight-use-package 'async)
(require 'async)

#+end_src

**** Littering
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-no-littering.el
:END:

#+begin_src emacs-lisp

;; no-littering
(straight-use-package 'no-littering)
(require 'no-littering)

#+end_src

**** Patching
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-el-patch.el
:END:

#+begin_src emacs-lisp

;; el-patch
(straight-use-package 'el-patch)
(require 'el-patch)

#+end_src


** UI
*** Home
**** emacs-dashboard
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-emacs-dashboard.el
:END:

#+begin_src emacs-lisp

;; requirements
(require 'projectile)
(require 'all-the-icons)
(require 'page-break-lines)

(straight-use-package 'dashboard)
(require 'dashboard)

(dashboard-setup-startup-hook)

;; options
(setq dashboard-center-content t)
(setq dashboard-set-file-icons t)

;; initial buffer choice
(if (and (not initial-buffer-choice)
         (string-equal (buffer-name (current-buffer)) "*scratch*"))
    (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*"))))

#+end_src

*** Buffer
**** olivetti
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-olivetti.el
:END:

#+begin_src emacs-lisp

;; centering
(straight-use-package 'olivetti)

(add-hook 'olivetti-mode-on-hook (lambda () (olivetti-set-width 0.9)))

;; normal modes
(dolist (mode '(org-mode-hook
		     shell-mode-hook
		     markdown-mode-hook
                latex-mode-hook))
  (add-hook mode 'olivetti-mode))

;; Programming modes
(add-hook 'prog-mode-hook 'olivetti-mode)

#+end_src

***** Patches

#+begin_src emacs-lisp

(require 'el-patch)

#+end_src

