elisp/modules/shapes-olivetti.el
;; centering
(straight-use-package 'olivetti)

(add-hook 'olivetti-mode-on-hook (lambda () (olivetti-set-width 0.9)))

;; normal modes
(dolist (mode '(org-mode-hook
		     shell-mode-hook
		     markdown-mode-hook
                latex-mode-hook))
  (add-hook mode 'olivetti-mode))

;; Programming modes
(add-hook 'prog-mode-hook #'olivetti-mode)

(require 'el-patch)
