shapes.org
****** olivetti-set-width

#+begin_src emacs-lisp

(el-patch-feature olivetti)
(el-patch-defun olivetti-set-width (width)
  "Set text body width to WIDTH with relative margins.
WIDTH may be an integer specifying columns or a float specifying
a fraction of the window width."
  (interactive
   (list (if current-prefix-arg
             (prefix-numeric-value current-prefix-arg)
           (read-number "Set text body width (integer or float): "
                        olivetti-body-width))))
  (setq olivetti-body-width width)
  (olivetti-set-buffer-windows)
  (el-patch-remove (message "Text body width set to %s" olivetti-body-width)))

#+end_src

**** solaire-mode
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-solaire-mode.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'solaire-mode)
(require 'solaire-mode)

#+end_src

**** page-break-lines
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-page-break-lines.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'page-break-lines)
(require 'page-break-lines)

#+end_src

*** Mode line
**** delight
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-delight.el
:END:

#+begin_src emacs-lisp

;; Customize names displayed in mode line
(straight-use-package 'delight)
(require 'delight)

;; Remove default modes from mode line
(delight '((global-command-log-mode nil "")
	   (olivetti-mode           nil "")
	   (which-key-mode          nil "")
	   (visual-line-mode        nil "simple")
	   (buffer-face-mode        nil "simple")
	   (org-indent-mode         nil "org")
	   (eldoc-mode              nil "eldoc")
	   ;; Major modes
	   (emacs-lisp-mode "EL" :major)))

#+end_src

*** Typefaces
**** all-the-icons
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-all-the-icons.el
:END:

#+begin_src emacs-lisp

;; Symbol library
(straight-use-package 'all-the-icons)

#+end_src

Now that ~all-the-icons~ is installed, all the icon typefaces must be actually present in
the local machine:

#+begin_src emacs-lisp :tangle no

(all-the-icons-install-fonts)

#+end_src

*** Highlights
**** svg-tag-mode
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-svg-tag-mode.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'svg-tag-mode)
(require 'svg-tag-mode)

(defconst date-re "[0-9]\\{4\\}-[0-9]\\{2\\}-[0-9]\\{2\\}")
(defconst time-re "[0-9]\\{2\\}:[0-9]\\{2\\}")
(defconst day-re "[A-Za-z]\\{3\\}")
(defconst day-time-re (format "\\(%s\\)? ?\\(%s\\)?" day-re time-re))

(defun svg-progress-percent (value)
  (svg-image (svg-lib-concat
              (svg-lib-progress-bar (/ (string-to-number value) 100.0)
                                    nil :margin 0 :stroke 2 :radius 3 :padding 2 :width 11)
              (svg-lib-tag (concat value "%")
                           nil :stroke 0 :margin 0)) :ascent 'center))

(defun svg-progress-count (value)
  (let* ((seq (mapcar #'string-to-number (split-string value "/")))
         (count (float (car seq)))
         (total (float (cadr seq))))
  (svg-image (svg-lib-concat
              (svg-lib-progress-bar (/ count total) nil
                                    :margin 0 :stroke 2 :radius 3 :padding 2 :width 11)
              (svg-lib-tag value nil
                           :stroke 0 :margin 0)) :ascent 'center)))

(setq svg-tag-tags
      `(
        ;; Org tags
        (":\\([A-Za-z0-9]+\\)" . ((lambda (tag) (svg-tag-make tag))))
        (":\\([A-Za-z0-9]+[ \-]\\)" . ((lambda (tag) tag)))
        
        ;; Task priority
        ("\\[#[A-Z]\\]" . ( (lambda (tag)
                              (svg-tag-make tag :face 'org-priority 
                                            :beg 2 :end -1 :margin 0))))

        ;; Progress
        ("\\(\\[[0-9]\\{1,3\\}%\\]\\)" . ((lambda (tag) (svg-progress-percent (substring tag 1 -2)))))
        ("\\(\\[[0-9]+/[0-9]+\\]\\)"   . ((lambda (tag) (svg-progress-count (substring tag 1 -1)))))
        
        ;; TODO / DONE
        ("TODO" . ((lambda (tag) (svg-tag-make "TODO" :face 'org-todo :inverse t :margin 0))))
        ("DONE" . ((lambda (tag) (svg-tag-make "DONE" :face 'org-done :margin 0))))


        ;; Citation of the form [cite:@Knuth:1984]
        ("\\(\\[cite:@[A-Za-z]+:\\)" . ((lambda (tag)
                                          (svg-tag-make tag
                                                        :inverse t
                                                        :beg 7 :end -1
                                                        :crop-right t))))
        ("\\[cite:@[A-Za-z]+:\\([0-9]+\\]\\)" . ((lambda (tag)
                                                (svg-tag-make tag
                                                              :end -1
                                                              :crop-left t))))
        
        ;; Active date (with or without day name, with or without time)
        (,(format "\\(<%s>\\)" date-re) .
         ((lambda (tag)
            (svg-tag-make tag :beg 1 :end -1 :margin 0))))
        (,(format "\\(<%s \\)%s>" date-re day-time-re) .
         ((lambda (tag)
            (svg-tag-make tag :beg 1 :inverse nil :crop-right t :margin 0))))
        (,(format "<%s \\(%s>\\)" date-re day-time-re) .
         ((lambda (tag)
            (svg-tag-make tag :end -1 :inverse t :crop-left t :margin 0))))

        ;; Inactive date  (with or without day name, with or without time)
         (,(format "\\(\\[%s\\]\\)" date-re) .
          ((lambda (tag)
             (svg-tag-make tag :beg 1 :end -1 :margin 0 :face 'org-date))))
         (,(format "\\(\\[%s \\)%s\\]" date-re day-time-re) .
          ((lambda (tag)
             (svg-tag-make tag :beg 1 :inverse nil :crop-right t :margin 0 :face 'org-date))))
         (,(format "\\[%s \\(%s\\]\\)" date-re day-time-re) .
          ((lambda (tag)
             (svg-tag-make tag :end -1 :inverse t :crop-left t :margin 0 :face 'org-date))))))

#+end_src

**** rainbow-mode
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-rainbow-mode.el
:END:

#+begin_src emacs-lisp

;; highlight HTML color strings in their own color
(straight-use-package 'rainbow-mode)

#+end_src

*** Completion
**** all-the-icons-completion
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-all-the-icons-completion.el
:END:

#+begin_src emacs-lisp

(require 'all-the-icons)

(straight-use-package '(all-the-icons-completion :type git :host github :repo "MintSoup/all-the-icons-completion"))

(all-the-icons-completion-mode)

#+end_src

** Themes
*** Themes
**** Ef
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-ef-themes.el
:END:

#+begin_src emacs-lisp

(straight-use-package '(ef-themes :type git :host nil :repo "https://git.sr.ht/~protesilaos/ef-themes"))
(require 'ef-themes)

#+end_src

**** Nano
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-nano-theme.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'nano-theme)
(require 'nano-theme)

;; always use load-theme + enable-theme for the nano themes
(advice-add 'enable-theme :around (lambda (orig-fun THEME) (if (string-match "^nano-.*" (symbol-name THEME))
                                                               (progn (load-theme THEME t t)
                                                                      (funcall orig-fun THEME))
                                                             (funcall orig-fun THEME))))

#+end_src

**** Doom
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-doom-themes.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'doom-themes)
(require 'doom-themes)

#+end_src

**** Modus
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-modus-themes.el
:END:

#+begin_src emacs-lisp

(setq modus-themes-headings
      '((0 . (monochrome))))

(straight-use-package 'modus-themes)
(modus-themes-load-themes)

#+end_src

**** Catpuccin
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-catppuccin-themes.el
:END:

#+begin_src emacs-lisp

(require 'autothemer)

(cl-flet ((repo (name) (concat config-directory "straight/repos/" name)))
  ;; install and rename repository directory to "catppuccin-themes"
  (if (not (file-exists-p (repo "catppuccin-themes/catppuccin-theme.el")))
      (progn (straight-use-package '(catppuccin-themes :type git :host github :repo "catppuccin/emacs"))
             (copy-directory (repo "emacs")
                             (repo "catppuccin-themes"))
             (delete-directory (repo "emacs") t)))
  (require 'catppuccin-theme           (repo "catppuccin-themes/catppuccin-theme.el"))
  (require 'catppuccin-frappe-theme    (repo "catppuccin-themes/catppuccin-frappe-theme.el"))
  (require 'catppuccin-latte-theme     (repo "catppuccin-themes/catppuccin-latte-theme.el"))
  (require 'catppuccin-mocha-theme     (repo "catppuccin-themes/catppuccin-mocha-theme.el"))
  (require 'catppuccin-macchiato-theme (repo "catppuccin-themes/catppuccin-macchiato-theme.el")))

#+end_src

**** Solarized
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-solarized-theme.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'solarized-theme)
(require 'solarized-theme)

#+end_src

**** Standalone
***** Sweet
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-sweet-theme.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'sweet-theme)
(require 'sweet-theme)

#+end_src

***** Graphite
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-graphite-theme.el
:END:

#+begin_src emacs-lisp

(straight-use-package '(graphite-theme :type git :host github :repo "codemicmaves/graphite-theme"))
(require 'graphite-light-theme)
(require 'graphite-dark-theme)

#+end_src

***** Chocolate
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-chocolate-theme.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'chocolate-theme)
(require 'chocolate-theme)

#+end_src

***** Doom Zen Writer
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-doom-zen-writer-theme.el
:END:

#+begin_src emacs-lisp

(load-file (concat config-directory "local/themes/doom-zen-writer-theme.el"))

#+end_src

*** Creation
**** autothemer
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-autothemer.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'autothemer)
(require 'autothemer)

#+end_src

*** Scheduling
**** circadian
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-circadian.el
:END:

#+begin_src emacs-lisp

(setq calendar-latitude      52.00667)
(setq calendar-longitude     4.355561)
(setq calendar-loadtion-name "Delft")
(setq calendar-standard-time-zone-name "CEST")
(setq calendar-daylight-time-zone-name "CET")

(straight-use-package 'circadian)
(setq circadian-themes `((:sunrise . ,light)  
			 (:sunset  . ,dark)))
(circadian-setup)

#+end_src

** Mode line
*** Nano
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-nano-modeline.el
:END:

#+begin_src emacs-lisp

;; nano-modeline
(straight-use-package 'nano-modeline)

;; mode line initialization hook
(add-hook 'after-init-hook #'nano-modeline-mode)

#+end_src

*** Doom
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-doom-modeline.el
:END:

#+begin_src emacs-lisp

;; doom-modeline
(straight-use-package 'doom-modeline)

;; bar
(setq-default doom-modeline-bar-width 0.01)

;; mode line initialization hook
(add-hook 'after-init-hook #'doom-modeline-mode)

#+end_src

*** Moody
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-moody.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'moody)

;; configuration
(setq x-underline-at-descent-line t)
(moody-replace-mode-line-buffer-identification)
(moody-replace-vc-mode)
(moody-replace-eldoc-minibuffer-message-function)

;; reload active theme
(let ((active-theme (car custom-enabled-themes)))
  (if active-theme (enable-theme active-theme)))

#+end_src

*** Spaceline
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-spaceline.el
:END:

#+begin_src emacs-lisp

;; spaceline
(straight-use-package 'spaceline)
(require 'spaceline-config)

;; mode line initialization hook
(add-hook 'after-init-hook #'spaceline-emacs-theme)

#+end_src


** Input
*** Editing
**** evil
:PROPERTIES:
:header-args: emacs-lisp :tangle ./modules/shapes-evil.el
:END:

#+begin_src emacs-lisp

;; evil
(straight-use-package 'evil)
(require 'evil)

;; bindings
(global-set-key (kbd "C-<escape>") #'evil-mode)

#+end_src

***** bugs

#+begin_src emacs-lisp

;; eliminate blinking cursor in pdf-pdf-view
(add-hook 'pdf-view-mode-hook (lambda ()
                                (set (make-local-variable 
                                      'evil-emacs-state-cursor)
                                     (list nil))))

#+end_src

***** states
