shapes.org
****** evil-god

#+begin_src emacs-lisp

;; evil god state
(straight-use-package 'evil-god-state)
(require 'evil-god-state)

(evil-define-key 'normal global-map (kbd ",") #'evil-execute-in-god-state)

(evil-define-key 'god    global-map (kbd "<escape>") #'evil-god-state-bail)

;; mode indicators
(setq evil-normal-state-tag   (propertize " COMMAND " 'face '((:background "dark khaki"     :foreground "black")))
      evil-emacs-state-tag    (propertize "  EMACS  " 'face '((:background "turquoise"      :foreground "black")))
      evil-insert-state-tag   (propertize " ------- " 'face '((:background "dark sea green" :foreground "black")))
      evil-replace-state-tag  (propertize " REPLACE " 'face '((:background "dark orange"    :foreground "black")))
      evil-motion-state-tag   (propertize "  MOTION " 'face '((:background "khaki"          :foreground "black")))
      evil-visual-state-tag   (propertize "  VISUAL " 'face '((:background "light salmon"   :foreground "black")))
      evil-operator-state-tag (propertize " OPERATE " 'face '((:background "sandy brown"    :foreground "black"))))

(setq evil-default-cursor (quote (t "#750000"))
      evil-visual-state-cursor '("green" hollow)
      evil-normal-state-cursor '("green" box)
      evil-insert-state-cursor '("pink" (bar . 2)))

#+end_src

****** evil-org

#+begin_src emacs-lisp

(with-eval-after-load 'org
  (straight-use-package 'evil-org)
  (require 'evil-org)
  (evil-org-set-key-theme '(navigation insert textobjects additional calendar))

  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys)

  ;; hooks
  (add-hook 'org-mode-hook  (lambda () (if evil-mode (evil-org-mode))))
  (add-hook 'evil-mode-hook (lambda () (if (string-equal major-mode "org-mode") (evil-org-mode)))))

#+end_src

**** meow
:PROPERTIES:
:header-args: emacs-lisp :tangle ./modules/shapes-meow.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'meow)
(require 'meow)

#+end_src

***** setup

#+begin_src emacs-lisp

(defun meow-setup ()
  (setq meow-cheatsheet-layout meow-cheatsheet-layout-qwerty)
  (meow-motion-overwrite-define-key
   '("j" . meow-next)
   '("k" . meow-prev)
   '("<escape>" . ignore))
  (meow-leader-define-key
   ;; SPC j/k will run the original command in MOTION state.
   '("j" . "H-j")
   '("k" . "H-k")
   ;; Use SPC (0-9) for digit arguments.
   '("1" . meow-digit-argument)
   '("2" . meow-digit-argument)
   '("3" . meow-digit-argument)
   '("4" . meow-digit-argument)
   '("5" . meow-digit-argument)
   '("6" . meow-digit-argument)
   '("7" . meow-digit-argument)
   '("8" . meow-digit-argument)
   '("9" . meow-digit-argument)
   '("0" . meow-digit-argument)
   '("/" . meow-keypad-describe-key)
   '("?" . meow-cheatsheet))
  (meow-normal-define-key
   '("0" . meow-expand-0)
   '("9" . meow-expand-9)
   '("8" . meow-expand-8)
   '("7" . meow-expand-7)
   '("6" . meow-expand-6)
   '("5" . meow-expand-5)
   '("4" . meow-expand-4)
   '("3" . meow-expand-3)
   '("2" . meow-expand-2)
   '("1" . meow-expand-1)
   '("-" . negative-argument)
   '(";" . meow-reverse)
   '("," . meow-inner-of-thing)
   '("." . meow-bounds-of-thing)
   '("[" . meow-beginning-of-thing)
   '("]" . meow-end-of-thing)
   '("a" . meow-append)
   '("A" . meow-open-below)
   '("b" . meow-back-word)
   '("B" . meow-back-symbol)
   '("c" . meow-change)
   '("d" . meow-delete)
   '("D" . meow-backward-delete)
   '("e" . meow-next-word)
   '("E" . meow-next-symbol)
   '("f" . meow-find)
   '("g" . meow-cancel-selection)
   '("G" . meow-grab)
   '("h" . meow-left)
   '("H" . meow-left-expand)
   '("i" . meow-insert)
   '("I" . meow-open-above)
   '("j" . meow-next)
   '("J" . meow-next-expand)
   '("k" . meow-prev)
   '("K" . meow-prev-expand)
   '("l" . meow-right)
   '("L" . meow-right-expand)
   '("m" . meow-join)
   '("n" . meow-search)
   '("o" . meow-block)
   '("O" . meow-to-block)
   '("p" . meow-yank)
   '("q" . meow-quit)
   '("Q" . meow-goto-line)
   '("r" . meow-replace)
   '("R" . meow-swap-grab)
   '("s" . meow-kill)
   '("t" . meow-till)
   '("u" . meow-undo)
   '("U" . meow-undo-in-selection)
   '("v" . meow-visit)
   '("w" . meow-mark-word)
   '("W" . meow-mark-symbol)
   '("x" . meow-line)
   '("X" . meow-goto-line)
   '("y" . meow-save)
   '("Y" . meow-sync-grab)
   '("z" . meow-pop-selection)
   '("'" . repeat)
   '("<escape>" . ignore)))

#+end_src

***** load

#+begin_src emacs-lisp

(meow-setup)
(meow-global-mode 1)

#+end_src

*** Commands
**** god-mode
:PROPERTIES:
:header-args: emacs-lisp :tangle ./modules/shapes-god-mode.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'god-mode)
(require 'god-mode)

;; god
(global-set-key (kbd "<escape>") #'god-mode-all)

;; local
(define-key god-local-mode-map (kbd "i") #'god-local-mode)

;; bindings
(define-key god-local-mode-map (kbd ".") #'repeat)
(define-key god-local-mode-map (kbd "]") #'forward-paragraph)
(define-key god-local-mode-map (kbd "[") #'backward-paragraph)

#+end_src

** Guidance
*** counsel
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-counsel.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'counsel)
(require 'counsel)

(global-set-key (kbd "<menu>") #'counsel-M-x)

#+end_src

*** helpful
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-helpful.el
:END:

#+begin_src emacs-lisp

;; replace description key bindings by their helpful equivalents
(straight-use-package 'helpful)

(setq counsel-describe-function-function  #'helpful-callable)
(setq counsel-describe-variable-function  #'helpful-variable)

(global-set-key [remap describe-function] #'helpful-function)
(global-set-key [remap describe-command]  #'helpful-command)
(global-set-key [remap describe-variable] #'helpful-variable)
(global-set-key [remap describe-key]      #'helpful-key)

#+end_src

*** which-key
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-which-key.el
:END:

#+begin_src emacs-lisp

;; command suggestions
(straight-use-package 'which-key)
(require 'which-key)

(setq which-key-idle-delay 1.0)

(which-key-mode)

#+end_src

*** command-log-mode                                                  :ARCHIVE:
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-command-log-mode.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'command-log-mode)
(require 'command-log-mode)

(global-command-log-mode)

#+end_src

** Completion
*** ivy
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-ivy.el
:END:

#+begin_src emacs-lisp

;; ivy
(straight-use-package 'ivy)
(require 'ivy)

(ivy-mode 1)

;; minibuffer bindings
(let ((map ivy-minibuffer-map))
  (cl-loop for binding in '(("<tab>"       . ivy-alt-done)
			    ("<up>"        . ivy-previous-line-or-history)
			    ("C-l"         . ivy-alt-done)
			    ("C-j"         . ivy-next-line)
			    ("C-k"         . ivy-previous-line)
			    ("<backspace>" . ivy-backward-delete-char))
            do (define-key map (kbd (car binding)) (cdr binding))))

;; switch-buffer bindings
(let ((map ivy-switch-buffer-map))
  (cl-loop for binding in '(("C-k"   . ivy-previous-line)
 			        ("C-l"   . ivy-done)
			        ("C-d"   . ivy-switch-buffer-kill))
            do (define-key map (kbd (car binding)) (cdr binding))))

;; reverse-i-search bindings
(let ((map ivy-reverse-i-search-map))
  (cl-loop for binding in '(("C-k"   . ivy-previous-line)
			        ("C-d"   . ivy-reverse-i-search-kill))
            do (define-key map (kbd (car binding)) (cdr binding))))

#+end_src

*** ivy-rich                                                          :ARCHIVE:
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-ivy-rich.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'ivy-rich)
(require 'ivy-rich)

(ivy-rich-mode 1)

#+end_src

*** vertico
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-vertico.el
:END:

#+begin_src emacs-lisp

(require 'savehist)
(savehist-mode)

(straight-use-package 'vertico)
(vertico-mode)

(defun crm-indicator (args)
  (cons (format "[CRM%s] %s"
                (replace-regexp-in-string
                 "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                 crm-separator)
                (car args))
        (cdr args)))
(advice-add 'completing-read-multiple :filter-args #'crm-indicator)

(setq minibuffer-prompt-properties
      '(read-only t cursor-intangible t face minibuffer-prompt))
(add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

(setq enable-recursive-minibuffers t)

#+end_src

*** orderless
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-orderless.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'orderless)

(setq completion-styles '(orderless basic))
(setq completion-category-defaults nil)
(setq completion-category-overrides '((file (styles partial-completion))))

#+end_src

** Navigation
*** ace-window
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-ace-window.el
:END:

#+begin_src emacs-lisp

;; ace-window
(straight-use-package 'ace-window)
(require 'ace-window)

(global-set-key (kbd "C-x o") #'ace-window)

#+end_src


** Search
*** swiper
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-swiper.el
:END:

#+begin_src emacs-lisp

;; Swiper
(straight-use-package 'swiper)
(require 'swiper)

#+end_src

**** mc

#+begin_src emacs-lisp

(defun custom/swiper-multiple-cursors ()
  (interactive)
  (swiper-mc)
  (minibuffer-keyboard-quit))

;; M-RET: multiple-cursors-mode
(define-key swiper-map (kbd "M-<return>") #'custom/swiper-multiple-cursors)

#+end_src

**** isearch

#+begin_src emacs-lisp

(defun custom/swiper-isearch (orig-fun &rest args)
  "`swiper-isearch' the selected region. If none are, `swiper-isearch'."
  (if (region-active-p)
      (let ((beg (region-beginning))
	    (end (region-end)))
	(deactivate-mark)
	(apply orig-fun (list (buffer-substring-no-properties beg end))))
    (apply orig-fun args)))

(advice-add 'swiper-isearch :around #'custom/swiper-isearch)

(define-key global-map (kbd "C-s") #'swiper-isearch)

#+end_src

*** ripgrep
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-rg.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'rg)
(require 'rg)

#+end_src

** Editing
*** Undo
**** TODO vundo
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-vundo.el
:END:

- undo-fu
- Back
   - Record character number in current line relative to the end of the line
   - If impossible to go to previous position, to recorded character number of previous line
   - Org Mode
      - restore visibility before undone command
      - if previous command created heading
         - undo heading creation and restore visibility

#+begin_src emacs-lisp

;; vundo
(straight-use-package 'vundo)

(global-set-key (kbd "C-v") #'vundo)

#+end_src

**** undo-tree                                                        :ARCHIVE:
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-undo-tree.el
:END:

#+begin_src emacs-lisp

;; undo-tree
(use-package undo-tree
  :bind (("M-/" . undo-tree-visualize)
         :map undo-tree-visualizer-mode-map
         ("RET" . undo-tree-visualizer-quit)
         ("ESC" . undo-tree-visualizer-quit))
  :config
  (global-undo-tree-mode))

#+end_src

***** Visualize in side buffer

#+begin_src emacs-lisp

;; visualize in side buffer
(defun custom/undo-tree-split-side-by-side (orig-fun &rest args)
  "Split undo-tree side-by-side"
  (let ((split-height-threshold nil)
        (split-width-threshold 0))
    (apply orig-fun args)))

(advice-add 'undo-tree-visualize :around #'custom/undo-tree-split-side-by-side)

#+end_src

*** Multiline
**** multiple-cursors
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-multiple-cursors.el
:END:

#+begin_src emacs-lisp

;; Multiple cursors
(straight-use-package 'multiple-cursors)
(require 'multiple-cursors)

;; mc-lists
(setq mc/list-file (concat config-directory "persistent/mc-lists.el"))

;; Create cursors
(global-set-key (kbd "C-.")         #'mc/mark-next-like-this)
(global-set-key (kbd "C-;")         #'mc/mark-previous-like-this)
(global-set-key (kbd "C-<mouse-1>") #'mc/add-cursor-on-click)
(global-unset-key [C-down-mouse-1]) ; necessary

;; Return as usual
(define-key mc/keymap (kbd "<return>")       #'electric-newline-and-maybe-indent)

;; Exit multiple-cursors-mode
(define-key mc/keymap (kbd "<escape>")       #'multiple-cursors-mode)
(define-key mc/keymap (kbd "<mouse-1>")      #'multiple-cursors-mode)
(define-key mc/keymap (kbd "<down-mouse-1>")   nil) ; necessary

#+end_src
** Workflow
*** Export
**** htmlize
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-htmlize.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'htmlize)

#+end_src

*** Session
