shapes.org
**** org-self-insert-command

#+begin_src emacs-lisp

(el-patch-feature org)
(el-patch-defun org-self-insert-command (N)
  "Like `self-insert-command', use overwrite-mode for whitespace in tables.
If the cursor is in a table looking at whitespace, the whitespace is
overwritten, and the table is not marked as requiring realignment."
  (interactive "p")
  (el-patch-remove (org-fold-check-before-invisible-edit 'insert))
  (cond
   ((and org-use-speed-commands
	 (let ((kv (this-command-keys-vector)))
	   (setq org-speed-command
		 (run-hook-with-args-until-success
		  'org-speed-command-hook
		  (make-string 1 (aref kv (1- (length kv))))))))
    (cond
     ((commandp org-speed-command)
      (setq this-command org-speed-command)
      (call-interactively org-speed-command))
     ((functionp org-speed-command)
      (funcall org-speed-command))
     ((consp org-speed-command)
      (eval org-speed-command t))
     (t (let (org-use-speed-commands)
	  (call-interactively 'org-self-insert-command)))))
   ((and
     (= N 1)
     (not (org-region-active-p))
     (org-at-table-p)
     (progn
       ;; Check if we blank the field, and if that triggers align.
       (and (featurep 'org-table)
	    org-table-auto-blank-field
	    (memq last-command
		  '(org-cycle org-return org-shifttab org-ctrl-c-ctrl-c))
	    (if (or (eq (char-after) ?\s) (looking-at "[^|\n]*  |"))
		;; Got extra space, this field does not determine
		;; column width.
		(let (org-table-may-need-update) (org-table-blank-field))
	      ;; No extra space, this field may determine column
	      ;; width.
	      (org-table-blank-field)))
       t)
     (looking-at "[^|\n]*  |"))
    ;; There is room for insertion without re-aligning the table.
    (self-insert-command N)
    (org-table-with-shrunk-field
     (save-excursion
       (skip-chars-forward "^|")
       ;; Do not delete last space, which is
       ;; `org-table-separator-space', but the regular space before
       ;; it.
       (delete-region (- (point) 2) (1- (point))))))
   (t
    (setq org-table-may-need-update t)
    (self-insert-command N)
    (org-fix-tags-on-the-fly)
    (when org-self-insert-cluster-for-undo
      (if (not (eq last-command 'org-self-insert-command))
	  (setq org-self-insert-command-undo-counter 1)
	(if (>= org-self-insert-command-undo-counter 20)
	    (setq org-self-insert-command-undo-counter 1)
	  (and (> org-self-insert-command-undo-counter 0)
	       buffer-undo-list (listp buffer-undo-list)
	       (not (cadr buffer-undo-list)) ; remove nil entry
	       (setcdr buffer-undo-list (cddr buffer-undo-list)))
	  (setq org-self-insert-command-undo-counter
		(1+ org-self-insert-command-undo-counter))))))))

#+end_src

**** TODO org-indent--compute-prefixes

- el-patch

#+begin_src emacs-lisp

(defun custom/org-indent--compute-prefixes ()
  "Recompute line prefixes for regular text to
match the indentation of the parent heading."
  (dotimes (n org-indent--deepest-level)
      (let ((indentation (if (= n 0) 0 1)))
        (aset org-indent--text-line-prefixes
	        n
	        (org-add-props
	           (concat (make-string (+ n indentation) ?\s))
		    nil 'face 'org-indent)))))

(advice-add 'org-indent--compute-prefixes :after #'custom/org-indent--compute-prefixes)

#+end_src

*** UI
**** org-modern
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-org-modern.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'org-modern)

(add-hook 'org-mode-hook #'org-modern-mode)
(add-hook 'org-agenda-finalize-hook #'org-modern-agenda)

#+end_src

***** Lists
****** Markers

#+begin_src emacs-lisp

(setq org-modern-list '((?+ . "-")
 		  	     (?- . "•")
 			     (?* . "▶")))

#+end_src

****** Checkboxes

#+begin_src emacs-lisp

(setq org-modern-checkbox nil)

#+end_src

***** Tables

#+begin_src emacs-lisp

;; Vertical table line width
(setq org-modern-table-vertical 1)

;; Horizontal table line width
(setq org-modern-table-horizontal 1)

#+end_src

***** Highlights

#+begin_src emacs-lisp

;; Tags
(setq org-modern-tag nil)

;; Priorities
(setq org-modern-priority nil)

#+end_src

**** org-appear
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-org-appear.el
:END:

#+begin_src emacs-lisp

(setq org-hide-emphasis-markers t)

(setq org-hidden-keywords '(title))

;; org-appear
(straight-use-package '(org-appear :type git :host github :repo "awth13/org-appear"))
(add-hook 'org-mode-hook #'org-appear-mode)

;; links
(setq org-appear-autolinks t)

;; keywords
(setq org-appear-autokeywords t)

;; symbols
(setq org-appear-autoentities t)

;; subscripts and superscripts
(setq org-appear-autosubmarkers t)
(setq org-appear-inside-latex t)

#+end_src

**** org-fragtog
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-org-fragtog.el
:END:

#+begin_src emacs-lisp

;; org-fragtog
(straight-use-package 'org-fragtog)
(require 'org-fragtog)

(add-hook 'org-mode-hook #'org-fragtog-mode)

#+end_src

*** Editing
**** org-paragraph
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-org-paragraph.el
:END:

#+begin_src emacs-lisp

(require 'org-paragraph (concat config-directory "elisp/packages/org-paragraph.el"))

#+end_src

***** org-meta-arrows-h

#+begin_src emacs-lisp

(defun custom/org-meta-arrows-h (orig-fun &rest args)
  "Paragraph indentation with `org-meta<arrows>'.
Furthermore, if a region is active and its
beginning lies on an Org Mode heading,
`custom/org-command-expand-region' to execute ORIG-FUN."
  (interactive)
  (cond ((custom/org-relative-line-paragraph) (custom/org-paragraph orig-fun args))
	    ((region-active-p)                    (custom/org-indent-region orig-fun args))
	    (t                                    (apply orig-fun args))))

(advice-add 'org-metaleft  :around #'custom/org-meta-arrows-h)
(advice-add 'org-metaright :around #'custom/org-meta-arrows-h)

#+end_src

***** TODO org-meta-arrows-v

- paragraphs
- visibility change when heading visibility is CHILDREN
   - save previous visibility
      - custom/org-subtree-state
         - overlay = overlays-in subtree-beg subtree-end
         - overlay-properties?
   - org-meta-v
   - if post visibility is not equal to previous
      - cycle back to previous visibility
   - rough
      - visibility change -> assume prev was CHILDREN -> 2 x org-cycle-internal-local

#+begin_src emacs-lisp

(defun custom/org-meta-arrows-v (orig-fun &rest args)
  (interactive)
  (if (custom/org-at-ellipsis)
      (progn (beginning-of-visual-line) (end-of-line)))
  (apply orig-fun args)
  (if (custom/org-relative-line-heading-folded)
      (outline-hide-subtree)))

(advice-add 'org-metaup   :around #'custom/org-meta-arrows-v)
(advice-add 'org-metadown :around #'custom/org-meta-arrows-v)

#+end_src

**** org-download
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-org-download.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'org-download)

(dolist (mode '(org-mode-hook
		dired-mode-hook))
  (add-hook mode 'org-download-enable))

;; download directory
(setq-default org-download-image-dir "./figures")

;; customize #+DOWNLOADED attribute
(defun custom/org-download-annotate (link)
  "Create a captioned and labeled figure."
  (concat "#+CAPTION:\n"
          "#+NAME: fig:\n"))
(setq org-download-annotate-function #'custom/org-download-annotate)

#+end_src

*** Templates
**** org-tempo
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-org-tempo.el
:END:

#+begin_src emacs-lisp

;; required as of Org 9.2
(require 'org-tempo)

;; navigation
(define-key org-mode-map (kbd "C-c f") #'tempo-forward-mark)
(define-key org-mode-map (kbd "C-c b") #'tempo-backward-mark)

#+end_src

***** LaTeX

#+begin_src emacs-lisp

;; equations
(tempo-define-template "latex-equation"
		          '("#+NAME: eq:" p n
			    "\\begin{equation}" n
			    p n
			    "\\end{equation}" >)
			  "<eq"
			  "LaTeX equation template")

(tempo-define-template "latex-derivation"
		          '("#+NAME: eq:" p n
			    "\\begin{equation}" n
			    "\\arraycolsep=3pt\\def\\arraystretch{2.25}" n
			    "\\begin{array}{lll}" n
			    p n
			    "\\end{array}" n
			    "\\end{equation}" >)
			  "<de"
			  "LaTeX derivation template")

#+end_src

***** Figures

#+begin_src emacs-lisp

;; figures
(tempo-define-template "fig"
		          '("#+NAME: fig:" p n
			    "#+CAPTION: " p n
			    "#+ATTR_ORG: :width 450" n
			    "[[./" p "]]" >)
			  "<f"
			  "Org Mode figure template")

#+end_src

***** Code blocks

#+begin_src emacs-lisp

(defun custom/tempo-code-block (key language)
  (tempo-define-template language
		         `("#+begin_src " ,language n
			   n
			   p n
			   n
			   "#+end_src" >)
			 key
			 language))

(dolist (pair '(("<sh"   "shell")
		("<el"   "emacs-lisp")
		("<py"   "python")
                ("<rs"   "rust")
                ("<cpp"  "C++")
		("<bash" "bash")
                ("<tx"   "latex")))
  (apply 'custom/tempo-code-block pair))

#+end_src

**** org-capture
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-org-capture.el
:END:

#+begin_src emacs-lisp

(require 'org-capture)

#+end_src

***** TODO Templates

- lecture
   - specify directory
   - template

*** Applications
**** Notes
***** bitacora
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-bitacora.el
:END:

#+begin_src emacs-lisp

(require 'bitacora (concat config-directory "elisp/packages/bitacora.el"))

#+end_src

***** org-roam
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-org-roam.el
:END:

Importantly, [[https://org-roam.discourse.group/t/no-emacsql-sqlite-binary-available-aborting-error-when-installing-org-roam-v2-on-mac/2178/6][a C compiler (eg: gcc or clang) must be installed for ~emacsql-sqlite~ to install correctly]].

#+begin_src emacs-lisp

;; org-roam
(straight-use-package 'org-roam)

#+end_src

****** UI

#+begin_src emacs-lisp

;; org-roam-ui
(straight-use-package 'org-roam-ui)

#+end_src

******** Follow

#+begin_src emacs-lisp

(setq org-roam-ui-follow t)

#+end_src

******** Theme

#+begin_src emacs-lisp

;; sync theme and ui
(setq org-roam-ui-sync-theme nil)

#+end_src

******** Startup

#+begin_src emacs-lisp

(setq org-roam-ui-open-on-start nil)

#+end_src

******** Update

#+begin_src emacs-lisp

(setq org-roam-ui-update-on-save t)

#+end_src

****** Hooks

#+begin_src emacs-lisp

;; node visit hook
(defvar custom/org-roam-node-visit-hook nil
   "Hook ran after `org-roam-node-visit'.")

(defun custom/run-org-roam-node-visit-hook (&rest _args)
   "Run `after-enable-theme-hook'."
   (run-hooks 'custom/org-roam-node-visit-hook))

;; enable-theme
(advice-add 'org-roam-node-visit :after #'custom/run-org-roam-node-visit-hook)

#+end_src

****** Startup
******* db-autosync-mode

#+begin_src emacs-lisp

(if (and (boundp 'org-roam-directory) (file-directory-p org-roam-directory))
    (org-roam-db-autosync-mode))

#+end_src

****** Keymap

#+begin_src emacs-lisp

(setq custom/org-roam-map (make-keymap))
(global-set-key (kbd "C-r") custom/org-roam-map)

;; Capture
(define-key custom/org-roam-map (kbd "c") #'org-roam-capture)

;; Find node
(define-key custom/org-roam-map (kbd "n") #'org-roam-node-find)

;; Insert reference
(define-key custom/org-roam-map (kbd "i") #'org-roam-node-insert)

#+end_src

****** Templates
******* Default

#+begin_src emacs-lisp

(setq org-roam-capture-templates
      '(("m" "mathematics" plain "%?"
         :target (file+head "mathematics/%<%Y%m%d%H%M%S>-${slug}.org"
			           "#+STARTUP: subtree\n\n\n\n#+title:${title}\n\n\n")
         :unnarrowed t)
        ("c" "control" plain "%?"
         :target (file+head "control/%<%Y%m%d%H%M%S>-${slug}.org"
			           "#+STARTUP: subtree\n\n\n\n#+title:${title}\n\n\n")
         :unnarrowed t)))

#+end_src

****** Timestamps

#+begin_src emacs-lisp

;; org-roam-timestamps
(straight-use-package 'org-roam-timestamps)
(require 'org-roam-timestamps)

;; remember
(setq org-roam-timestamps-remember-timestamps nil)
(setq org-roam-timestamps-minimum-gap 3600)

;; visit hook
(add-hook 'custom/org-roam-node-visit-hook #'org-roam-timestamps-mode)

;; capture hook
(defvar custom/org-roam-timestamps-mode-active-before-capture nil)

(defun custom/org-roam-timestamps-mode-off ()
  "Disable `org-roam-timestamps-mode' in Org Roam capture buffers."
  (setq custom/org-roam-timestamps-mode-active-before-capture org-roam-timestamps-mode)
  (org-roam-timestamps-mode -1))
(add-hook 'org-roam-capture-new-node-hook #'custom/org-roam-timestamps-mode-off)

(defun custom/org-roam-timestamps-mode-back ()
  "Re-enable `org-roam-timestamps-mode' after finalizing capture,
if it was previously enabled."
  (if custom/org-roam-timestamps-mode-active-before-capture
      (org-roam-timestamps-mode)))
(add-hook 'org-capture-after-finalize-hook #'custom/org-roam-timestamps-mode-back)

#+end_src

**** Agenda
***** org-agenda
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-org-agenda.el
:END:

#+begin_src emacs-lisp

;; org-agenda
(require 'org-agenda)
(global-set-key (kbd "C-c a") #'org-agenda)

#+end_src

****** Entries
******* Tag alignment

#+begin_src emacs-lisp

;; Tag indentation
(setq org-tags-column 70)

#+end_src

****** Agenda
******* Editing

#+begin_src emacs-lisp

;; Mark items as done
(defun custom/org-agenda-todo-done ()
  (interactive)
  (org-agenda-todo 'done))

(define-key org-agenda-mode-map (kbd "d") 'custom/org-agenda-todo-done)

#+end_src

******* Navigation
******** TODO Visit

- org-recenter -> unfold -> move away -> fold back
   - arrows -> fold previous item
   - recenter -> unfold item
- currently- 
   - org-recenter -> all todo items unfolded

#+begin_src emacs-lisp :tangle no

(defun custom/org-agenda-recenter (arg)
  (interactive "P")
  (let ((last-called (get this-command 'custom/last-call-time)))
    (if (eq last-command this-command)
        (progn (custom/org-restore-outline-state)
	       (org-agenda-recenter arg))
      (progn (custom/org-save-outline-state)
	     (org-agenda-recenter arg))))
  (put this-command 'custom/last-call-time (current-time)))

(define-key org-agenda-mode-map (kbd "<tab>") 'org-agenda-recenter)

#+end_src

**** Contacts
***** org-contacts
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-org-contacts.el
:END:

#+begin_src emacs-lisp

;; org-contacts
(straight-use-package '(org-contacts :type git :host nil :repo "https://repo.or.cz/org-contacts.git"))
(require 'org-contacts)

#+end_src

