shapes.org
****** Template

#+begin_src emacs-lisp

(defvar custom/org-capture-contacts "* %(org-contacts-template-name)
:PROPERTIES:
:ADDRESS: %^{289 Cleveland St. Brooklyn, 11206 NY, USA}
:BIRTHDAY: %^{yyyy-mm-dd}
:EMAIL: %(org-contacts-template-email)
:NOTE: %^{NOTE}
:END:" "org-contacts template")

(add-to-list 'org-capture-templates
   `(("c" "contact" entry
      (file ,(nth 0 org-contacts-files))
      ,custom/org-capture-contacts)))

#+end_src

**** Calendar
***** org-calendar
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-org-calendar.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'calfw)
(straight-use-package 'calfw-org)
(straight-use-package 'calfw-ical)

;; org-agenda configuration is lost otherwise
(with-eval-after-load 'org-agenda
  (require 'calfw-org)
  (require 'calfw-ical))

(defun custom/org-calendar ()
  "Open `calfw' Org Agenda calendar."
  (interactive)
  (require 'org-agenda)
  (let ((inhibit-message t))
       (cfw:open-org-calendar)))

(global-set-key (kbd "C-c c") #'custom/org-calendar)

#+end_src

**** Programming
***** org-babel
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-org-babel.el
:END:
****** Editing

#+begin_src emacs-lisp

;; src edit buffer in current window
(setq org-src-window-setup "current-window")

#+end_src

****** Languages

#+begin_src emacs-lisp

;; Language packages
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python     . t)
   (C          . t)
   (shell      . t)
   (latex      . t)))

#+end_src

******* Bash

#+begin_src emacs-lisp

(defun org-babel-bash-initiate-session (&optional session _params)
  "Initiate a bash/sh session named SESSION according to PARAMS."
  (org-babel-sh-initiate-session session _params))

#+end_src

******* Python

#+begin_src emacs-lisp

(setq org-babel-python-command "python3")

#+end_src

****** Execution

#+begin_src emacs-lisp

;; suppress security confirmation when evaluating code
(setq org-confirm-babel-evaluate nil)

#+end_src

****** Typesetting
******* Indentation

#+begin_src emacs-lisp

;; Set indentation of code blocks to 0
(setq org-edit-src-content-indentation 0)

;; Indent code blocks appropriately when inside headers
(setq org-src-preserve-indentation     nil)

;; Make code indentation reasonable
(setq org-src-tab-acts-natively        t)

#+end_src

****** Default header arguments

#+begin_src emacs-lisp

(setq org-babel-default-header-args
      '((:noweb   . "yes")
        (:async   . "yes")
        (:session . "ob-session")
        (:results . "replace")
        (:exports . "code")
        (:cache   . "no")
        (:hlines  . "no")
        (:tangle  . "no")))

#+end_src

***** ob-async
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-ob-async.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'ob-async)
(require 'ob-async)

#+end_src

**** Presentations
***** org-reveal
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-org-reveal.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'org-reveal)
(require 'ox-reveal)
(load-library "ox-reveal")

(setq org-reveal-root "https://cdn.jsdelivr.net/npm/reveal.js")

#+end_src

**** Time-tracking
***** org-agenda-log-mode
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-org-agenda-log-mode.el
:END:

#+begin_src emacs-lisp

;; Org Agenda log mode
(setq org-agenda-start-with-log-mode t)
(setq org-log-done 'time)
(setq org-log-into-drawer t)

#+end_src

** Tabulated lists
*** tablist
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./modules/shapes-tablist.el
:END:

#+begin_src emacs-lisp

(straight-use-package 'tablist)

#+end_src


* Extensions

Content of an extension:
- Functions
   - If interactive, function bindings
- Macros

** Utilities
*** Get
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./extensions/shapes-get.el
:END:

#+begin_src emacs-lisp
;;; -*- lexical-binding: t; -*-
#+end_src

**** UI
***** get-active-theme

#+begin_src emacs-lisp

;; Retrieve current theme
(defun custom/get-active-theme ()
  (substring (format "%s" (nth 0 custom-enabled-themes))))

#+end_src

**** Text
***** get-point

#+begin_src emacs-lisp

(defun custom/get-point (command &rest args)
  (interactive)
  (save-excursion
    (apply command args)
    (point)))

#+end_src

***** get-last-change

#+begin_src emacs-lisp

(defun custom/get-last-change ()
  "Retrieve last change in current buffer."
  (setq last-change (nth 1 buffer-undo-list))
  (let ((beg (car last-change))
        (end (cdr last-change)))
    (buffer-substring-no-properties beg end)))

#+end_src

***** count-substrings

#+begin_src emacs-lisp

(defun custom/count-substrings (regexp str)
  "Return the number of substrings of STR matching REGEXP"
  (loop with start = 0
        for count from 0
        while (string-match regexp str start)
        do (setq start (match-end 0))
        finally return count))

#+end_src

**** Data
***** get-keyword-key-value

#+begin_src emacs-lisp

(defun custom/get-keyword-key-value (kwd)
   (let ((data (cadr kwd)))
     (list (plist-get data :key)
           (plist-get data :value))))

#+end_src

**** Buffer
***** get-visible-buffers

#+begin_src emacs-lisp

(defun custom/get-visible-buffers ()
  (cl-delete-duplicates (mapcar #'window-buffer (window-list))))

#+end_src

***** get-buffer-by-file-name

#+begin_src emacs-lisp

(defun custom/get-buffer-by-file-name (file)
  (cl-loop for buffer in (buffer-list)
	        if (string-equal (buffer-name buffer) (file-name-nondirectory file))
	           return buffer
		finally return nil))

#+end_src

**** Window
***** get-active-window-number

#+begin_src emacs-lisp

(defun custom/get-active-window-number ()
  "Retrieve the current window's number."
  (setq window (prin1-to-string (get-buffer-window (current-buffer))))
  (string-match "^[^0-9]*\\([0-9]+\\).*$" window)
  (match-string 1 window))

#+end_src

**** Keymap
***** get-keymaps

#+begin_src emacs-lisp

(defvar custom/keymap-list '()
  "List containing the symbols of all keymaps in the `obarray'.")

(defun custom/get-keymaps ()
  "Return a list containing the symbols of all keymaps in the `obarray'."
  (mapatoms (lambda (m) (if (condition-case nil
                                (or (keymapp (symbol-value m))
                                    (keymapp m))
                              (error nil))
                            (add-to-list 'custom/keymap-list m))
          obarray))
  (when (called-interactively-p 'interactive)
        (message "Keymap list updated, %s keymaps found" (length custom/keymap-list)))
  custom/keymap-list)

#+end_src

***** get-keymap-symbol

#+begin_src emacs-lisp

(defun custom/get-keymap-symbol (keymap)
  "Return the symbol to which KEYMAP is bound, or nil if no such symbol exists."
  (catch 'gotit
    (mapatoms (lambda (sym)
                (and (boundp sym)
                     (eq (symbol-value sym) keymap)
                     (not (eq sym 'keymap))
                     (throw 'gotit sym))))))

#+end_src

-----
References:

- [[https://stackoverflow.com/a/14490054][user4815162342, Answer to "Emacs name of current local keymap?", StackOverflow]]

*** Queries
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./extensions/shapes-queries.el
:END:

#+begin_src emacs-lisp
;;; -*- lexical-binding: t; -*-
#+end_src

**** At
***** eolp

#+begin_src emacs-lisp

(defun custom/eolp (orig-fun &rest args)
  (interactive)
  (or (apply orig-fun args) (looking-at-p "[[:blank:]]*$")))

(advice-add 'eolp :around #'custom/eolp)

#+end_src

***** at-point

#+begin_src emacs-lisp

(defun custom/at-point (go-to-point &optional point)
  (let ((point (or point (point))))
    (save-excursion
      (funcall go-to-point)
      (= point (point)))))

#+end_src

***** at-indent

#+begin_src emacs-lisp

(defun custom/at-indent (&optional point)
  (and (custom/relative-line-indented) (custom/at-point 'back-to-indentation point)))

#+end_src

**** Line
***** relative-line

#+begin_src emacs-lisp

(defun custom/relative-line (query &optional number &rest args)
  "Return the result of a boolean query at the beginning
of the current visual line, or another specified by its
relative position to the current line.
Optionally, `args' may be given as input to be passed
to the query at execution."
  (let ((number (or number 0)))
    (save-excursion
      (beginning-of-visual-line)
      (beginning-of-line-text (+ number 1))
      (apply query args))))

#+end_src

***** relative-line-regex

#+begin_src emacs-lisp

(defun custom/relative-line-regex (pattern &optional number)
  (let ((number (or number 0)))
    (save-excursion
      (beginning-of-line-text (+ number 1))
      (setq line (buffer-substring-no-properties (custom/get-point 'beginning-of-line) (custom/get-point 'end-of-line))))
    (string-match-p pattern line)))

#+end_src

***** relative-line-list

#+begin_src emacs-lisp

(defun custom/relative-line-list (&optional number)
  (custom/relative-line-regex "^[[:blank:]]*\\([0-9]+[.\\)]\\{1\\}\\|[-+*]\\{1\\}\\)[[:blank:]]+.*$" number))

#+end_src

***** relative-line-empty

#+begin_src emacs-lisp

(defun custom/relative-line-empty (&optional number)
  (custom/relative-line-regex "^[[:space:]]*$" number))

#+end_src

***** TODO relative-line-wrapped

- &optional number

#+begin_src emacs-lisp

(defun custom/relative-line-wrapped ()
  (> (custom/get-point 'beginning-of-visual-line) (custom/get-point 'beginning-of-line-text)))

#+end_src

***** relative-line-indented

#+begin_src emacs-lisp

(defun custom/relative-line-indented (&optional number)
  (custom/relative-line-regex "^[[:blank:]]+.*$" number))

  #+end_src

***** relative-line-list-ordered

#+begin_src emacs-lisp

(defun custom/relative-line-list-ordered (&optional number)
  (custom/relative-line-regex "^[[:blank:]]*[0-9]+[.\\)]\\{1\\}[[:blank:]]+.*$" number))

#+end_src

***** relative-line-list-unordered

#+begin_src emacs-lisp

(defun custom/relative-line-list-unordered (&optional number)
  (custom/relative-line-regex "^[[:blank:]]*[-+*]\\{1\\}[[:blank:]]+.*$" number))

#+end_src

**** Region
