shapes.org
***** region-blank

#+begin_src emacs-lisp

(defun custom/region-blank (&optional beg end)
  (let ((beg (or beg (region-beginning)))
	      (end (or end (region-end))))
    (setq region (buffer-substring-no-properties beg end))
    (string-match "\\`[[:space:]]*\\'$" region)))

#+end_src

***** region-multiline-visual

#+begin_src emacs-lisp

(defun custom/region-multiline-visual ()
  "Return t if a region is active and spans more than one visual line."
  (and (region-active-p) (> (custom/region-count-visual-lines) 1)))

#+end_src

***** region-count-visual-lines

#+begin_src emacs-lisp

(defun custom/region-count-visual-lines ()
  "Count visual lines in an active region."
  (interactive)
  (save-excursion 
    (beginning-of-visual-line)
    (count-screen-lines (region-beginning) (region-end))))

#+end_src

*** Execution
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./extensions/shapes-execution.el
:END:

#+begin_src emacs-lisp
;;; -*- lexical-binding: t; -*-
#+end_src

**** @buffers

#+begin_src emacs-lisp

(defmacro custom/@buffers (command &optional buffers)
  (let ((buffers (or buffers (buffer-list))))
    `(cl-loop for buffer in ',buffers
              do (if (buffer-live-p buffer)
                     (save-window-excursion
                       (switch-to-buffer buffer)
                       ,command)))))

#+end_src

*** Operators
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./extensions/shapes-operators.el
:END:

#+begin_src emacs-lisp
;;; -*- lexical-binding: t; -*-
#+end_src

**** <>

#+begin_src emacs-lisp

(defun <> (a b c)
  (and (> b a) (> c b)))

#+end_src


** UI
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./extensions/shapes-ui.el
:END:

#+begin_src emacs-lisp
;;; -*- lexical-binding: t; -*-
#+end_src

*** Text
**** Theme accents

#+begin_src emacs-lisp

;; accent typefaces
(defvar custom/accents '(custom/italic))

(defun custom/theme-accents (orig-fun &rest args)
  "Many themes will override certain face *attributes*, such as `italic'. To prevent
this, this function loops over all accent typefaces in `custom/accents', which contains
faces (defined with `defface') named ~custom/<attribute>~, and makes the ~<attribute>~
inherit from ~custom/<attribute>~.

As such, when this function is run, the `italic' face attribute will be made to
inherit from `custom/italic' as in the expression below.

   (set-face-attribute 'italic nil :inherit 'custom/italic)

Thus, our preferred accent typefaces will stand whatever harassment they may be put
through as a theme loads."
  ;; load theme
  (apply orig-fun args)
  ;; restore accents
  (cl-loop for accent in custom/accents
	   do (let ((face (intern (car (last (split-string (symbol-name accent) "/"))))))
		     (set-face-attribute face nil :inherit accent))))

(advice-add 'load-theme :around #'custom/theme-accents)

#+end_src

*** Window
**** Quit

#+begin_src emacs-lisp

(defun custom/quit-window ()
  (interactive)
  (if current-prefix-arg
      (quit-window)
    (quit-window 1)))

(with-eval-after-load 'helpful
  (cl-loop for map in '(help-mode-map
                        helpful-mode-map)
           do (define-key (symbol-value map) [remap quit-window] #'custom/quit-window)))

#+end_src

**** Resize
***** window-resize

#+begin_src emacs-lisp

(defun custom/window-resize (width)
  (window-resize nil (- width (window-width)) t))

#+end_src

***** window-resize-fraction

#+begin_src emacs-lisp

(defun custom/window-resize-fraction (fr &optional min)
  "Resize window to a fraction of the frame width."
  (interactive)
  (let ((width (max (if min min 0) (truncate (* fr (frame-width))))))
    (window-resize nil (- width (window-width)) t)))

#+end_src

*** Warnings
**** C-g is undefined

#+begin_src emacs-lisp

;; Record last sent message
(defvar last-message nil)
(defadvice message (after my-message pre act) (setq last-message ad-return-value))

(defun custom/undefined-override (orig-fun &rest args)
  "Override `undefined' function to suppress
undefined key binding messages when interrupting
key binding input with C-g."
  (let ((inhibit-message t)
	    (message-log-max nil))
    (progn (apply orig-fun args)
	       (setq _message last-message)))
  (if (string-match-p (regexp-quote "C-g is undefined") _message)
      (keyboard-quit)
    (message _message)))

;; Override the undefined key binding notice with a keyboard-quit
(advice-add 'undefined :around #'custom/undefined-override)

#+end_src

*** Mode line
**** Hide

#+begin_src emacs-lisp

(defcustom custom/mode-line nil
  "Variable containing the format of the hidden mode line")

(defcustom custom/header-line nil
  "Variable containing the format of the hidden header line")

(defun custom/hide-mode-line ()
  "Hide `modeline' in current buffer"
  (interactive)
  (let ((m mode-line-format)
        (h header-line-format))
       (custom/@buffers (if (or m h)
                            (progn (setq custom/mode-line   m)
                                   (setq custom/header-line h)
                                   (setq mode-line-format   nil)
                                   (setq header-line-format nil))
                          (progn (setq mode-line-format custom/mode-line)
                                 (setq header-line-format custom/header-line))))))

(global-set-key (kbd "M-m") #'custom/hide-mode-line)

#+end_src

**** Invert

#+begin_src emacs-lisp

(defun custom/mode-line-invert ()
  (interactive)
  (if mode-line-format
      (custom/@buffers (progn (set 'header-line-format mode-line-format)
                              (set 'mode-line-format nil)))
    (custom/@buffers (progn (set 'mode-line-format header-line-format)
                            (set 'header-line-format nil)))))

(global-set-key (kbd "M-t") #'custom/mode-line-invert)

#+end_src

** Themes
*** Switch
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./extensions/shapes-theme-switch.el
:END:

#+begin_src emacs-lisp
;;; -*- lexical-binding: t; -*-
#+end_src

**** Load

#+begin_src emacs-lisp

(defun custom/enable-or-load-theme (theme)
  (condition-case nil
      (enable-theme theme)
    (error (load-theme theme))))

#+end_src

**** Hook

#+begin_src emacs-lisp

(defvar custom/enable-or-load-theme-hook nil
   "`load-theme' hook.")

(defun custom/enable-or-load-theme-hook (&rest _args)
   "Run `load-theme-hook'."
   (run-hooks 'custom/enable-or-load-theme-hook))

(advice-add 'enable-theme :after #'custom/enable-or-load-theme-hook)
(advice-add 'load-theme   :after #'custom/enable-or-load-theme-hook)

#+end_src

**** Toggle

#+begin_src emacs-lisp

(defun custom/theme-toggle ()
  "Toggle between `dark' and `light' themes
using `enable-theme'"
  (interactive)
  (let ((theme (nth 0 custom-enabled-themes)))
    (cond ((string-equal theme light) (progn (disable-theme light)
					     (custom/enable-or-load-theme dark)))
	  (t                          (progn (disable-theme dark)
					     (custom/enable-or-load-theme light))))))

(global-set-key (kbd "C-t") #'custom/theme-toggle)

#+end_src

**** Light and dark

#+begin_src emacs-lisp

(defcustom custom/light-dark-themes '("modus"
                                      "nano")
  "Themes with light and dark versions.")

(defcustom custom/theme-advice-dark '()
  "List of functions run when loading the `dark' theme, if it is included in `custom/light-dark-themes'.")

(defcustom custom/theme-advice-light '()
  "List of functions run when loading the `light' theme, if it is included in `custom/light-dark-themes'.")

(defun custom/theme-specific-advice (orig-fun &rest args)
  "Apply theme-specific advice when enabling themes, and
preserve modeline status through theme changes."
  (setq modeline-status mode-line-format)
  (apply orig-fun args)
  (let ((theme (nth 0 args)))
    (if (string-match-p (string-join custom/light-dark-themes "\\|") (symbol-name theme))
        (let ((advice-list (if (string-equal theme light)
                               custom/theme-advice-light
                             custom/theme-advice-dark)))
          (dolist (advice advice-list)
            (funcall advice))))
  (setq mode-line-format modeline-status)))

;; add
(advice-add 'enable-theme :around #'custom/theme-specific-advice)
(advice-add 'load-theme   :around #'custom/theme-specific-advice)

#+end_src

***** Line numbers

#+begin_src emacs-lisp

(defvar custom/dark-line-number-colors '("#cfcfcf" "#262626")
  "Line number HTML colors for dark themes: FOREGROUND, BACKGROUND")

(defvar custom/light-line-number-colors '("#878787" "#ededed")
  "Line number HTML colors for light themes: FOREGROUND, BACKGROUND")

(defun custom/line-number-set-colors (fg bg)
  "Set the foreground (FG) and background (BG) colors of the line numbers
displayed by `display-line-numbers-mode'."
  (set-face-attribute 'line-number nil :foreground fg :background bg))

(defun custom/set-dark-line-number-colors ()
  (apply 'custom/line-number-set-colors custom/dark-line-number-colors))

(defun custom/set-light-line-number-colors ()
  (apply 'custom/line-number-set-colors custom/light-line-number-colors))

(add-to-list 'custom/theme-advice-dark  #'custom/set-dark-line-number-colors)
(add-to-list 'custom/theme-advice-light #'custom/set-light-line-number-colors)

;; reload active theme
(let ((active-theme (car custom-enabled-themes)))
  (if active-theme (enable-theme active-theme)))

#+end_src

