shapes.org
*** Search and replace

#+begin_src emacs-lisp

(defun custom/query-replace-regexp ()
  (interactive)
  (save-excursion
    (beginning-of-buffer)
    (call-interactively 'query-replace-regexp)))

(global-set-key (kbd "M-/") #'custom/query-replace-regexp)

#+end_src

** Workflow
*** Session
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./extensions/shapes-session.el
:END:

#+begin_src emacs-lisp

(defun custom/load-session ()
  (interactive)
  (let ((session (read-file-name "Select session: "
                                 "~/sessions/"
                                 nil
                                 nil
                                 (car (directory-files "~/sessions/" nil "\\`[^.]*\\'")))))
    (desktop-change-dir session)
    (wg-load (concat session ".wg"))
    (call-interactively 'wg-switch-to-workgroup)))

(global-set-key (kbd "C-x s") #'custom/load-session)

#+end_src

*** External programs
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./extensions/shapes-external-programs.el
:END:
**** Keymap
#+begin_src emacs-lisp

(defcustom custom/external-application-map (make-keymap)
  "External application keymap")

(defcustom custom/external-application-bindings '()
  "List of external application key-binding pairs")

(defun custom/bind-external-application (binding)
  (add-to-list 'custom/external-application-bindings binding))

(global-set-key (kbd "C-c C-o") custom/external-application-map)

#+end_src

**** Codium

#+begin_src emacs-lisp

(defun open-in-codium ()
  (interactive)
  (let ((root (projectile-root-bottom-up (file-name-directory buffer-file-name))))
    (call-process-shell-command (concat "codium " root "&") nil 0)))

(custom/bind-external-application '("c" . open-in-codium))

#+end_src

**** Firefox

#+begin_src emacs-lisp

(defun open-in-firefox ()
  (interactive)
  (call-process-shell-command (concat "firefox-trunk \"" (buffer-file-name) "\"") nil 0))

(custom/bind-external-application '("f" . open-in-firefox))

#+end_src

**** Binding definition

#+begin_src emacs-lisp

(dolist (binding custom/external-application-bindings)
  (define-key custom/external-application-map (kbd (car binding)) (cdr binding)))

#+end_src


** Navigation
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./extensions/shapes-navigation.el
:END:

#+begin_src emacs-lisp
;;; -*- lexical-binding: t; -*-
#+end_src

*** Text
**** TODO end

- in wrapped line
   - end of visual line -> end of line
- else
   - end of line -> end of visual line

#+begin_src emacs-lisp

;; Double end to go to the beginning of line
(defvar custom/double-end-timeout 0.4)

(defun custom/double-end ()
  "Move to end of visual line. If the command is repeated 
within `custom/double-end-timeout' seconds, move to end
of line."
  (interactive)
  (let ((last-called (get this-command 'custom/last-call-time)))
    (if (and (eq last-command this-command)
             (<= (time-to-seconds (time-since last-called)) custom/double-end-timeout))
        (progn (beginning-of-visual-line) (end-of-line))
      (end-of-visual-line)))
  (put this-command 'custom/last-call-time (current-time)))

(global-set-key (kbd "<end>") #'custom/double-end)

#+end_src

**** home

#+begin_src emacs-lisp

(defun custom/home ()
  "Conditional homing. 

Default: `beginning-of-line-text'

If the current line is empty, home to `beginning-of-line'.

If the current line holds a list item, home back to `beginning-of-line-text'.

If the current line is indented, home `back-to-indentation'.

If the current mode is derived from `prog-mode', home `back-to-indentation'.

If the current line is a wrapped visual line, home to
`beginning-of-visual-line'."
  (interactive)
  (cond ((custom/relative-line-empty)    (beginning-of-line))
	((custom/relative-line-list)     (beginning-of-line-text))
	((custom/relative-line-indented) (back-to-indentation))
	((custom/relative-line-wrapped)  (beginning-of-visual-line))
	((derived-mode-p 'prog-mode)     (back-to-indentation))
	((custom/relative-line-wrapped)  (beginning-of-visual-line))
        (t                               (beginning-of-line-text))))

(defvar custom/double-home-timeout 0.4)

(defun custom/double-home ()
  "Dynamic homing command with a timeout of `custom/double-home-timeout' seconds.
- Single press: `custom/home' 
- Double press: `beginning-of-visual-line'"
  (interactive)
  (let ((last-called (get this-command 'custom/last-call-time)))
    (if (and (eq last-command this-command)
	     (<= (time-to-seconds (time-since last-called)) custom/double-home-timeout))
	(progn (beginning-of-visual-line)
	       (beginning-of-line-text))
      (custom/home)))
  (put this-command 'custom/last-call-time (current-time)))

(global-set-key (kbd "<home>") #'custom/double-home)

#+end_src

**** previous-line

#+begin_src emacs-lisp

(defun custom/previous-line (orig-fun &rest args)
  "If a region is active and either the current mode is derived from
`prog-mode' or the cursor lies in an `org-babel' source code block,
arrow-up to `end-of-visual-line' of `previous-line'."
  (apply orig-fun args)
  (if (and (region-active-p) (or (derived-mode-p 'prog-mode) (org-in-src-block-p)))
      (progn (point-to-register 'region-up-register)
             (end-of-visual-line))))

(advice-add 'previous-line :around #'custom/previous-line)

(defun custom/region-up-register ()
  "Move cursor to `region-up-register', defined in
`custom/previous-line'."
  (interactive)
  (let ((end (region-end)))
    (ignore-errors (jump-to-register 'region-up-register))
    (set-register 'region-up-register nil)
    (push-mark end)))

(global-set-key (kbd "S-<home>") #'custom/region-up-register)

#+end_src

**** beginning-of-line-text

#+begin_src emacs-lisp

(defun custom/beginning-of-line-text (orig-fun &rest args)
  "Correctly go to `beginning-of-line-text' in numbered lists."
  (interactive)
  (let ((ordered-line-regex "^[[:blank:]]*[0-9]+[.\\)]\\{1\\}[[:blank:]]\\{1\\}"))
    (if (save-excursion (beginning-of-line)
			    (looking-at-p ordered-line-regex))
	    (progn (beginning-of-line)
		   (re-search-forward ordered-line-regex))
      (apply orig-fun args))))

(advice-add 'beginning-of-line-text :around #'custom/beginning-of-line-text)

#+end_src

*** Window
**** Split and follow

#+begin_src emacs-lisp

;; split and follow
(defun split-and-follow-horizontally ()
  (interactive)
  (split-window-below)
  (other-window 1))
(global-set-key (kbd "C-x 2") #'split-and-follow-horizontally)

(defun split-and-follow-vertically ()
  (interactive)
  (split-window-right)
  (other-window 1))
(global-set-key (kbd "C-x 3") #'split-and-follow-vertically)

#+end_src

**** Previous window
***** Record

#+begin_src emacs-lisp

(defvar custom/window-previous nil
  "Selected window before the last window change.")

(defvar custom/window-pre-command nil
  "Auxiliary variable containing the `selected-window'
before the execution of any command.")

(defun custom/record-window-pre-command ()
  (setq custom/window-pre-command (selected-window)))
(add-hook 'pre-command-hook #'custom/record-window-pre-command)

(defun custom/record-window-previous ()
  (let ((window-post (selected-window)))
    (if (not (eq window-post custom/window-pre-command))
	      (setq custom/window-previous custom/window-pre-command))))
(add-hook 'post-command-hook #'custom/record-window-previous)

#+end_src

***** TODO Command

- if single window, do nothing

#+begin_src emacs-lisp

(defun custom/goto-window-previous ()
  (interactive)
  (let ((target  custom/window-previous)
	      (current (selected-window)))
    (if target
	      (progn (select-window target)
		     (setq custom/window-previous current)))))

(global-set-key (kbd "C-c p") #'custom/goto-window-previous)

#+end_src


** File management
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./extensions/shapes-file-management.el
:END:

#+begin_src emacs-lisp
;;; -*- lexical-binding: t; -*-
#+end_src

*** Buffer
**** Reload from disk

#+begin_src emacs-lisp

(defun custom/reload-from-disk (&optional buffer)
  "Revert BUFFER contents to the contents of its
file saved on disk, ignoring the auto-save file.
If the buffer has unsaved modifications, prompt
the user for confirmation."
  (interactive)
  (let ((buffer (or buffer (current-buffer))))
    (save-window-excursion
      (switch-to-buffer buffer)
      (if (not (buffer-modified-p))
	     (revert-buffer t t)
	   (revert-buffer t nil)))))

(global-set-key (kbd "C-c r") #'custom/reload-from-disk)

#+end_src

*** Batch processing
**** DOS to UNIX

#+begin_src emacs-lisp

;; Transform all files in directory from DOS to Unix line breaks
(defun custom/dos2unix (&optional dir)
  (let ((default-directory (or dir (file-name-directory buffer-file-name))))
    (shell-command "find . -maxdepth 1 -type f -exec dos2unix \\{\\} \\;")))

#+end_src


** PDF
:PROPERTIES:
:header-args:emacs-lisp+: :tangle ./extensions/shapes-pdf.el
:END:
*** Jump

#+begin_src emacs-lisp

(defun custom/pdf-view-jump-to-top ()
  (interactive)
  (image-previous-line 9999))

(defun custom/pdf-view-jump-to-bottom ()
  (interactive)
  (image-next-line 9999))

(define-key pdf-view-mode-map (kbd "<home>") #'custom/pdf-view-jump-to-top)
(define-key pdf-view-mode-map (kbd "<end>")  #'custom/pdf-view-jump-to-bottom)

#+end_src

