extensions/shapes-pdf.el
(defun custom/pdf-view-jump-to-top ()
  (interactive)
  (image-previous-line 9999))

(defun custom/pdf-view-jump-to-bottom ()
  (interactive)
  (image-next-line 9999))

(define-key pdf-view-mode-map (kbd "<home>") #'custom/pdf-view-jump-to-top)
(define-key pdf-view-mode-map (kbd "<end>")  #'custom/pdf-view-jump-to-bottom)
