shapes.org
****** Default formats

#+begin_src emacs-lisp

(defvar custom/org-babel-result-wrap-formats
  '(((assq :wrap (nth 2 info))
     (let* ((full (or (cdr (assq :wrap (nth 2 info))) "results"))
	    (split (split-string full))
	    (type (car split))
	   (opening-line (concat "#+begin_" full))
	   (closing-line (concat "#+end_" type)))
       (cond
        ;; Escape contents from "export" wrap.  Wrap
        ;; inline results within an export snippet with
        ;; appropriate value.
        ((eq t (compare-strings type nil nil "export" nil nil t))
	 (let ((backend (pcase split
			  (`(,_) "none")
			  (`(,_ ,b . ,_) b))))
	   (funcall wrap
		    opening-line closing-line
		    nil nil
		    (format "{{{results(@@%s:"
			    backend) "@@)}}}")))
        ;; Escape contents from "example" wrap.  Mark
        ;; inline results as verbatim.
	((eq t (compare-strings type nil nil "example" nil nil t))
	 (funcall wrap
		  opening-line closing-line
		  nil nil
		  "{{{results(=" "=)}}}"))
	;; Escape contents from "src" wrap.  Mark
	;; inline results as inline source code.
	((eq t (compare-strings type nil nil "src" nil nil t))
	 (let ((inline-open
		(pcase split
		  (`(,_)
		   "{{{results(src_none{")
		  (`(,_ ,language)
		   (format "{{{results(src_%s{" language))
		  (`(,_ ,language . ,rest)
		   (let ((r (mapconcat #'identity rest " ")))
		     (format "{{{results(src_%s[%s]{"
			     language r))))))
	   (funcall wrap
		    opening-line closing-line
		    nil nil
		    inline-open "})}}}")))
	;; Do not escape contents in non-verbatim
	;; blocks.  Return plain inline results.
	(t
	 (funcall wrap
		  opening-line closing-line
		  t nil
		  "{{{results(" ")}}}")))))
    ((member "html" result-params)
     (funcall wrap "#+begin_export html" "#+end_export" nil nil
	      "{{{results(@@html:" "@@)}}}"))
    ((member "latex" result-params)
     (funcall wrap "#+begin_export latex" "#+end_export" nil nil
	      "{{{results(@@latex:" "@@)}}}"))
    ((member "org" result-params)
     (goto-char beg) (when (org-at-table-p) (org-cycle))
     (funcall wrap "#+begin_src org" "#+end_src" nil nil
	      "{{{results(src_org{" "})}}}"))
    ((member "code" result-params)
     (let ((lang (or lang "none")))
       (funcall wrap (format "#+begin_src %s%s" lang results-switches)
		"#+end_src" nil nil
		(format "{{{results(src_%s[%s]{" lang results-switches)
		"})}}}")))
    ((member "raw" result-params)
     (goto-char beg) (when (org-at-table-p) (org-cycle)))
    ((or (member "drawer" result-params)
	 ;; Stay backward compatible with <7.9.2
	 (member "wrap" result-params))
     (goto-char beg) (when (org-at-table-p) (org-cycle))
     (funcall wrap ":results:" ":end:" 'no-escape nil
	      "{{{results(" ")}}}"))
    ((and inline (member "file" result-params))
     (funcall wrap nil nil nil nil "{{{results(" ")}}}"))
    ((and (not (funcall tabulablep result))
	  (not (member "file" result-params)))
     (let ((org-babel-inline-result-wrap
	    ;; Hard code {{{results(...)}}} on top of
	    ;; customization.
	    (format "{{{results(%s)}}}"
		    org-babel-inline-result-wrap)))
       (org-babel-examplify-region
	beg end results-switches inline)))))

#+end_src

****** Custom formats
******* LaTeX equations

Display results inside of a LaTeX ~equation~ environment, and automatically preview it with ~org-latex-preview~.

#+begin_src emacs-lisp

(add-to-list 'custom/org-babel-result-wrap-formats
             '((member "latex-eq" result-params)
               (progn (funcall wrap "\\begin{equation}" "\\end{equation}" nil nil
	                       "{{{results(@@latex:" "@@)}}}"))
                      (org-latex-preview)))

#+end_src

